app/Controllers/Register.php

INSERT INTO `users` (`first_name`, `last_name`, `email`, `phone`, `address`, `city`, `state`, `zip_code`, `password`, `user_type`, `is_active`, `email_verified`, `created_at`, `updated_at`) VALUES ('Gregor', 'Samsa', 'ggsamsa@lc.com', '(555) 196-2213', '123 Main Street', 'District 1', 'AZ', '12345', '$2y$10$o5CUKGpqX01sa.h8tOAVQOiAFcgHnuSrc2eusA8KWeuvkomWIbO66', 'customer', 1, 0, '2026-10-07 01:27:52', '2026-10-07 01:27:52')
---
        ];

        try {
            // User::hashPassword() is registered as a beforeInsert callback.
            // Pass the plain password to insert(); the model hashes it once.
            $userId = $this->userModel->insert($userData);